artillery/scenario.yaml
config:
  target: "http://base-url.com"
  http:
    timeout: 20
    maxSockets: 30
  phases:
    - duration: 60
      arrivalRate: 4

scenarios:
  - flow:
      - get:
          url: "/list"
          headers: 
            Authorization: "bearer abcd"
      - get:
          url: "/detail/1"
          headers:
            Authorization: "bearer abcd"